{"comms":{"64":"This server is for the randomizer focused on the 3DS version of Ocarina of Time. If you would like to view the server focused on the original randomizer for the Nintendo 64, it can be found [here]( https://discord.gg/ootrandomizer ).","mm3dr":"The Majora's Mask 3D Randomizer can be found [here]( https://discord.com/invite/73ZNdjbfFp ).","cows":"A list of all cows in Ocarina of Time can be found [here](<https://wiki.ootrandomizer.com/index.php?title=Cows>).","citra":"To play 3DS games on your PC or an Android device, you can use [Citra](https://citra-emu.org). Please note you will still need to own a copy of OOT3D and a 3DS to dump it with. For a guide on how to do so, you can use `!dump`.","dump":"To dump a game ROM for use in Citra, you will need to follow the steps listed [here](<https://3ds.hacks.guide/dumping-titles-and-game-cartridges>). A 3DS with CFW installed is required. To install CFW, you can follow [this guide](<https://3ds.hacks.guide/get-started>).","glossary":"A list of acronyms commonly used for different aspects of Ocarina of Time can be found [here](<https://wiki.ootrandomizer.com/index.php?title=Glossary>).","grottos":"A list of all grottos and their locations in Ocarina of Time can be found [here](<https://wiki.ootrandomizer.com/index.php?title=Grottos>).","hash":"The seed hash is a set of five seemingly random items. This hash does not affect the game. It is a representation of the settings and seed used when generating the patch, and is used for verification that two players generated the same patch. To view the seed hash, you can press select while in-game. The seed hash is also displayed immediately after patch creation.","latest":"To download the latest version of the randomizer, you can go [here](<https://github.com/gamestabled/OoT3D_Randomizer/releases>) and look for the most recent one. This is almost always the first one listed.","logic":"The randomizer logic setting determines how it places items. It helps to ensure a beatable seed.\n- Glitchless: Beat the seed with no glitches required\n- Glitched: For more experienced players, some glitches may be required to beat but will still be possible\n- No Logic: No logic is used during patch creation and all items are placed fully randomly. Heavy use of glitches may be required and it may be impossible to beat.\n- Vanilla: Play the game with all of the items in their usual locations, but with the other QoL upgrades the randomizer has to offer.\n\nFor help with different logic tricks, which add additional ways to attain item locations in the logic, you can visit [here](<https://wiki.ootrandomizer.com/index.php?title=Logic>).","log":"The spoiler log is a list of all settings and item locations. This is useful for when you are stuck or identifying bugs.\nTo access your spoiler log:\n- Console: Access your SD card's files through whatever means necessary, such as a homebrew app or plugging it into your PC. The spoiler log can be found under the `3ds` folder. The filenamename will reflect that of your seed hash. (You can use `!hash` for more information.)\n- Citra: First you need to locate your installation folder. On PC Citra this can be done by opening Citra, and going to File > Open Citra Folder. On Android Citra it will be under a folder titled `citra-emu` in your device's storage. From there, go into the sdmc and 3ds folders. The filename will reflect that of your seed hash. (You can use !hash for more information.)","multiworld":"Multiworld play is not currently available for the OOT3D Randomizer.","pot":"Pot shuffle is not currently available for the OOT3D Randomizer.","enemy":"Enemy randomization is not currently available for the OOT3D Randomizer. Bosses however can be shuffled if you so please.","progressive":"Progressive items are those that will always be obtained in the order from weakest to strongest. For example, there are two progressive hookshots within the game. It does not matter which you obtain first, it will always be the hookshot. The second one you obtain will always be the longshot. What follows is a list of progressive items.\n- Fairy Ocarina -> Ocarina of Time\n- Hookshot -> Longshot\n- Bomb Bag -> Big Bomb Bag -> Biggest Bomb Bag\n- Goron Bracelet -> Silver Gauntlets -> Gold Gauntlets\n- Fairy Slingshot -> Big Bullet Bag -> Biggest Bullet Bag\n- Fairy Bow -> Big Quiver -> Biggest Quiver\n- Silver Scale -> Gold Scale\n- Adult's Wallet -> Giant's Wallet -> Tycoon's Wallet (Exclusive to randomizer Shop-sanity)\n- Magic Meter -> Big Magic Meter\n- Deku Stick Capacity Upgrades\n- Deku Nut Capacity Upgrades","rom":"A guide on how to obtain ROMs from games you own can be found by using `!dump`. A list of all Nintendo games for free can be found at [htṭps://freeroms.nintendo.com/oot3d](<https://www.youtube.com/watch?v=dQw4w9WgXcQ>)[.]( https://raw.githubusercontent.com/Kestron06/OOT3DBot/main/piracy.png )","scrubs":"A list of all Business Scrubs and their locations can be found [here](<https://wiki.ootrandomizer.com/index.php?title=Scrubs>).","source":"The OOT3D Randomizer is fully open-source, and can be viewed [here]( https://github.com/gamestabled/OoT3D_Randomizer ).","texture":"Texture packs are for the vast majority only usable within the Citra emulator (You can use `!citra` for more information). A list of publicly available texture packs can be found [here](<https://gamebanana.com/mods/cats/10842>).","tracker":"The only currently available automatic tracker for OOT3D can be accessed by pressing Select while in-game. For a list of external manual trackers, you can visit [here](<https://wiki.ootrandomizer.com/index.php?title=Trackers>)."},"prefix":"!"}